Ran Plan for dir: `terraform/atlantis` workspace: `default`

<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # kubernetes_secret.tls has been changed
~ resource "kubernetes_secret" "tls" {
      ~ data      = (sensitive value)
        id        = "pritunl/wayofthesys-com-pritunl-tls"
        # (2 unchanged attributes hidden)

      ~ metadata {
          ~ annotations      = {
              + "cert-manager.io/alt-names"        = "pritunl.wayofthesys.com"
              + "cert-manager.io/certificate-name" = "wayofthesys-com-pritunl-tls"
              + "cert-manager.io/common-name"      = "pritunl.wayofthesys.com"
              + "cert-manager.io/ip-sans"          = ""
              + "cert-manager.io/issuer-group"     = "cert-manager.io"
              + "cert-manager.io/issuer-kind"      = "ClusterIssuer"
              + "cert-manager.io/issuer-name"      = "zerossl"
              + "cert-manager.io/uri-sans"         = ""
            }
            name             = "wayofthesys-com-pritunl-tls"
          ~ resource_version = "16375692" -> "16376098"
            # (4 unchanged attributes hidden)
        }
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # kubernetes_secret.tls will be updated in-place
~ resource "kubernetes_secret" "tls" {
      ~ data      = (sensitive value)
        id        = "pritunl/wayofthesys-com-pritunl-tls"
        # (2 unchanged attributes hidden)

      ~ metadata {
          ~ annotations      = {
              - "cert-manager.io/alt-names"        = "pritunl.wayofthesys.com" -> null
              - "cert-manager.io/certificate-name" = "wayofthesys-com-pritunl-tls" -> null
              - "cert-manager.io/common-name"      = "pritunl.wayofthesys.com" -> null
              - "cert-manager.io/ip-sans"          = "" -> null
              - "cert-manager.io/issuer-group"     = "cert-manager.io" -> null
              - "cert-manager.io/issuer-kind"      = "ClusterIssuer" -> null
              - "cert-manager.io/issuer-name"      = "zerossl" -> null
              - "cert-manager.io/uri-sans"         = "" -> null
            }
            name             = "wayofthesys-com-pritunl-tls"
            # (5 unchanged attributes hidden)
        }
    }

  # tls_cert_request.request must be replaced
-/+ resource "tls_cert_request" "request" {
      ~ cert_request_pem = <<-EOT
            -----BEGIN CERTIFICATE REQUEST-----
            MIIDBjCCAe4CAQAwNTERMA8GA1UEChMIQXRsYW50aXMxIDAeBgNVBAMTF3ByaXR1
            bmwud2F5b2Z0aGVzeXMuY29tMIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKC
            AQEA5lJDYAk0g4CxkJCu6amgCAZ2ISd7rvsuvGJNP+h/BS/6N1VtDxuNm/kVkUGR
            HJ+hjgDI8h0c8B9V5zJsQVf/vohlYFDfzysiME0hwejyXiaPaeSMX0VZRUqVGBNG
            08/MIwGncogGau8Rk5zXoF7tBHjIPMlU5oNorLS95Mfl5FqC/Uz2kARNBcPPPpbp
            gkb9aJymPgIQf9cmIqXqlXQesNMueCyLlXNgy6k9uaLE4TlihNUhUOhKppT+Oi/j
            KCY+tsv5+utzopPimJeb90E+5froxRAjKMlJ0MW+0DHTqsZD2gnmPwnaRZ73wma3
            rZMmUCrWdgNCA2cov/hSRUy8GwIDAQABoIGLMIGIBgkqhkiG9w0BCQ4xezB5MHcG
            A1UdEQRwMG6CCGF0bGFudGlzgg5hdGxhbnRpcy5sb2NhbIIiYXRsYW50aXMuZGVm
            YXVsdC5zdmMuY2x1c3Rlci5sb2NhbIIJbG9jYWxob3N0ghdwcml0dW5sLndheW9m
            dGhlc3lzLmNvbYcEfwAAAYcEisUw9zANBgkqhkiG9w0BAQsFAAOCAQEA1zteii8W
            xXoU420RsJSglP0n7BycQZlQZNpStXRTC0jgtLLGTOtBNVAuCMq8QzjHN7xL6okF
            3NUAJDyah73uqR29Hj2z3Us4olor55I5K0lDAn4Y3NprDWth9ejsYv0eiLhqC0b9
            5BLq+mM5FhKEcEVSlwiymUSxw3StnvCVf2gKDoBKdgd3eyEipayLU7O2ZAvc/AUv
            0DEtcF5gvrApvpE51FE6+CPuoXUjnRTgzXF3H3JZhIGiz/Ayp7P8btO/+KT2lj58
            Nwey93q46AUBQlbll6SMPzuqGf/brbsG3c4PaTmp8eFtKQ9iXUhW/hNxcrqWUJd/
            e6IPU2beys5KvQ==
            -----END CERTIFICATE REQUEST-----
        EOT -> (known after apply)
      ~ dns_names        = [ # forces replacement
            # (4 unchanged elements hidden)
            "pritunl.wayofthesys.com",
          + "vpn.wayofthesys.com",
        ]
      ~ id               = "bd65263b60fe87b500efff18a405fa1f641dcdc5" -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ subject {
          - street_address = [] -> null
            # (2 unchanged attributes hidden)
        }
    }

  # tls_locally_signed_cert.cert must be replaced
-/+ resource "tls_locally_signed_cert" "cert" {
      ~ cert_pem              = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIDvzCCAqegAwIBAgIQU3KtzUKiTvWlntHnR4e1BDANBgkqhkiG9w0BAQsFADAl
            MRAwDgYDVQQKEwdQcml0dW5sMREwDwYDVQQDEwhjYS5sb2NhbDAeFw0yMjA0MTky
            MDMwNTRaFw0yMzA0MTkyMDMwNTRaMDUxETAPBgNVBAoTCEF0bGFudGlzMSAwHgYD
            VQQDExdwcml0dW5sLndheW9mdGhlc3lzLmNvbTCCASIwDQYJKoZIhvcNAQEBBQAD
            ggEPADCCAQoCggEBAOZSQ2AJNIOAsZCQrumpoAgGdiEne677LrxiTT/ofwUv+jdV
            bQ8bjZv5FZFBkRyfoY4AyPIdHPAfVecybEFX/76IZWBQ388rIjBNIcHo8l4mj2nk
            jF9FWUVKlRgTRtPPzCMBp3KIBmrvEZOc16Be7QR4yDzJVOaDaKy0veTH5eRagv1M
            9pAETQXDzz6W6YJG/Wicpj4CEH/XJiKl6pV0HrDTLngsi5VzYMupPbmixOE5YoTV
            IVDoSqaU/jov4ygmPrbL+frrc6KT4piXm/dBPuX66MUQIyjJSdDFvtAx06rGQ9oJ
            5j8J2kWe98Jmt62TJlAq1nYDQgNnKL/4UkVMvBsCAwEAAaOB2jCB1zAOBgNVHQ8B
            Af8EBAMCAqQwHQYDVR0lBBYwFAYIKwYBBQUHAwIGCCsGAQUFBwMBMAwGA1UdEwEB
            /wQCMAAwHwYDVR0jBBgwFoAUiX7mn7B4BkrbgISk8XecJhMj9owwdwYDVR0RBHAw
            boIIYXRsYW50aXOCDmF0bGFudGlzLmxvY2FsgiJhdGxhbnRpcy5kZWZhdWx0LnN2
            Yy5jbHVzdGVyLmxvY2Fsgglsb2NhbGhvc3SCF3ByaXR1bmwud2F5b2Z0aGVzeXMu
            Y29thwR/AAABhwSKxTD3MA0GCSqGSIb3DQEBCwUAA4IBAQCJnXZZkFrA8AbAhxZz
            fIYbBARiW13Uk5dGrUGxkBdeNdqsMO+fQnYnoXTqyeLR4HOmGnosnD41rgu0q3zp
            NnywD8doUEQHwiysSw66OX5eXGMc46oHIsqoNv0PnvMtMTbR7D475a6iHvUFyC2R
            ajmSsHyajH8tyid9z6JSpIngp7Pga95KiGTOchK++XjOMzmpGpsO8TJmbQ2AtG7v
            yeMZOtx+96rtebbWVYweR3DJ0r4WeTzq14A6NTXYACLo44elrFBwYooMACaxSkC5
            XNnL4HWBijdaulsnLkxd0UC+6ocopWRtq1tlsfpsjENVgZH4UEcxv+6XdBrR7pzT
            YmNo
            -----END CERTIFICATE-----
        EOT -> (known after apply)
      ~ cert_request_pem      = "fe3bd1e0ff62625977693dacce4477b4d9125881" -> (known after apply) # forces replacement
      ~ id                    = "110921370611277964470799525342932874500" -> (known after apply)
      ~ ready_for_renewal     = false -> true
      ~ validity_end_time     = "2023-04-19T20:30:54.793906102Z" -> (known after apply)
      ~ validity_start_time   = "2022-04-19T20:30:54.793906102Z" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.

Warning: Version constraints inside provider configuration blocks are deprecated

  on providers.tf line 12, in provider "digitalocean":
  12:   version = ">=1.5.0"

Terraform 0.13 and earlier allowed provider version constraints inside the
provider configuration block, but that is now deprecated and will be removed
in a future version of Terraform. To silence this warning, move the provider
version constraint into the required_providers block.

Warning: Argument is deprecated

  with tls_self_signed_cert.ca,
  on tls.tf line 24, in resource "tls_self_signed_cert" "ca":
  24:   key_algorithm   = tls_private_key.ca.algorithm

This is now ignored, as the key algorithm is inferred from the
`private_key_pem`.

(and 5 more similar warnings elsewhere)

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/atlantis`
* :put_litter_in_its_place: To **delete** this plan click [here](https://wayofthesys.com/lock?id=autotune%252Fpritunl-k8s-tf-do%252Fterraform%252Fatlantis%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/atlantis`
</details>
Plan: 2 to add, 1 to change, 2 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
